In [8]:
import numpy as np
import pandas as pd
import datetime
from sqlalchemy import create_engine
from sqlalchemy.types import String

# <SQLAlchemy Documents> https://docs.sqlalchemy.org/en/20/dialects/index.html

In [9]:
engine = create_engine("sqlite:///:memory:")
with engine.connect() as conn, conn.begin():
    data = pd.read_sql_table("data", conn)

ValueError: Table data not found

In [10]:
c = ["id", "Date", "Col_1", "Col_2", "Col_3"]
d = [
    (26, datetime.datetime(2023, 10, 18), "X", 27.5, True),
    (41, datetime.datetime(2023, 10, 19), "Y", -12.5, False),
    (63, datetime.datetime(2023, 10, 20), "Z", 5.73, True),
]

data = pd.DataFrame(d, columns=c)
data

   id       Date Col_1  Col_2  Col_3
0  26 2023-10-18     X  27.50   True
1  41 2023-10-19     Y -12.50  False
2  63 2023-10-20     Z   5.73   True

In [11]:
# chunksize, data types
data.to_sql("data", engine, chunksize=1000)

3

In [12]:
data.to_sql("data_dtypes", engine, dtype = {"Col_1":String})

3

In [ ]:
# Datetime data types
# Insertion method

# Alternative to_sql() *method* for DBs that suport COPY FROM
import csv
from io import StringIO

def psql_insert_copy(table, conn, keys, data_iter):
    """
    Execute SQL statement inserting data

    Parameters
    ----------
    table : pandas.io.sql.SQLTable
    conn : sqlclchemy.engine.Engine or sqlalchemy.enine.Connection
    keys : list of str
      Column names
      data_iter : Iterable that iterates the values to be inserted
    """

    #  get a DBAPI connection that can provide a cursor

    dbapi_conn = conn.connection
    with dbapi_conn.cursor() as cur:
        s_buf = StringIO()
        writer = csv.writer(s_buf)
        writer.writerows(data_iter)
        s_buf.seek(0)

        columns = ', '.join(['"{}"'.format(k) for k in keys])
        if table.schema:
            table_name = '{}.{}'.format(table.schema, table.name)
        else:
            talbe_name = table.name
        
        sql = 'COPY {} ({}) FROM STDIN WITH CSV'.format(table_name, columns)
        cur.copy_expert(sql= sql, file = s_buf)

In [13]:
# Reading Tables : read_sql_table()
pd.read_sql_table("data", engine)

   index  id       Date Col_1  Col_2  Col_3
0      0  26 2023-10-18     X  27.50   True
1      1  41 2023-10-19     Y -12.50  False
2      2  63 2023-10-20     Z   5.73   True

In [15]:
pd.read_sql_table("data", engine, columns=["Col_1", "Col_2"])

  Col_1  Col_2
0     X  27.50
1     Y -12.50
2     Z   5.73

In [16]:
# You can explicitly force columns to be parsed as dates
pd.read_sql_table("data", engine, parse_dates=["Date"])

   index  id       Date Col_1  Col_2  Col_3
0      0  26 2023-10-18     X  27.50   True
1      1  41 2023-10-19     Y -12.50  False
2      2  63 2023-10-20     Z   5.73   True

In [26]:
pd.read_sql_table("data", engine, parse_dates={"Date": "%Y-%m-%d"})

   index  id       Date Col_1  Col_2  Col_3
0      0  26 2023-10-18     X  27.50   True
1      1  41 2023-10-19     Y -12.50  False
2      2  63 2023-10-20     Z   5.73   True

In [24]:
# formatに沿って読み取ること。
pd.read_sql_table(
    "data",
    engine,
    parse_dates = {"Date": {"format": "%Y-%d-%m %H:%M:%S"}},
    ).iloc[2, 2].month

10

In [27]:
# Schema support
# SQLit does not have schema's

pd.read_sql_query("SELECT * FROM data", engine)

   index  id                        Date Col_1  Col_2  Col_3
0      0  26  2023-10-18 00:00:00.000000     X  27.50      1
1      1  41  2023-10-19 00:00:00.000000     Y -12.50      0
2      2  63  2023-10-20 00:00:00.000000     Z   5.73      1

In [31]:
# Syntaxに注意
pd.read_sql_query("SELECT id, Col_1, Col_2 FROM data WHERE id = 41;", engine)

   id Col_1  Col_2
0  41     Y  -12.5

In [36]:
df = pd.DataFrame(np.random.randn(20, 3), columns=list("abc"))
df.to_sql("data_chunks", engine, index=False)

20

In [37]:
for chunk in pd.read_sql_query("SELECT * FROM data_chunks", engine, chunksize=5):
    print(chunk)

          a         b         c
0  0.056512 -0.061222  0.022050
1  0.840246  1.284985  0.065320
2  1.559175  0.952213 -0.950974
3 -0.860214 -0.407175 -0.326320
4  0.341847 -0.634171  0.035338
          a         b         c
0  0.853816 -2.376678 -1.824801
1 -0.561738  0.791809  0.729464
2  0.503822  1.294157  0.207806
3  1.401592  0.054104  0.028520
4  0.036515 -1.987475 -1.189645
          a         b         c
0  0.227243  0.036431 -0.724743
1  0.058987  0.875183  3.081290
2 -1.289181  0.922079 -0.224016
3 -1.752081  0.363682 -0.069209
4  0.417048 -0.210674 -0.863189
          a         b         c
0 -0.022293  1.831760 -0.934883
1  0.414671  1.732895  0.224663
2  1.540469  1.299964 -1.829226
3 -0.548956 -0.853158 -1.097993
4  0.334487  0.795031 -0.261868

In [ ]:
# Engine connection examples
# to connect with SQLAlchemy you use the create_engine() function to create an engine object from database URI.
# You only need to create the engine once per database you are connecting to.

from sqlalchemy import create_engine
engine = create_engine("postgresql://scott:tiger@localhost:5432/mydatabase")
engine = create_engine("mysql+mysqldb://scott:tiger@localhost/foo")
engine = create_engine("orcle://scott:tiger@127..0.1:1521/sidname")
engine = create_engine("mssql+pyodbc://mydsn")

# sqlite://<nohostname>/<path>
# where <path> is relative:
engine = crea_engine("sqlite:///goo.db")

# or absolute, starting with a slash:
engine = create_engine("sqlite:///absolute/path/to/foo.db")

In [40]:
# Advanced SQLAlchemy queries : SQLAlchemy constructs
import sqlalchemy as sa
pd.read_sql(
    sa.text("SELECT * FROM data where Col_1=:col1"), engine, params = {"col1":"X"}
)

   index  id                        Date Col_1  Col_2  Col_3
0      0  26  2023-10-18 00:00:00.000000     X   27.5      1

In [41]:
metadata = sa.MetaData()
data_table = sa.Table(
    "data",
    metadata,
    sa.Column("index", sa.Integer),
    sa.Column("Date", sa.DateTime),
    sa.Column("Col_1", sa.String),
    sa.Column("Col_2", sa.Float),
    sa.Column("Col_3", sa.Boolean),
)

pd.read_sql(sa.select(data_table).where(data_table.c.Col_3 is True), engine)

Empty DataFrame
Columns: [index, Date, Col_1, Col_2, Col_3]
Index: []

In [49]:
import datetime as dt
expr = sa.select(data_table).where(data_table.c.Date > sa.bindparam("date"))
pd.read_sql(expr, engine, params={"date": dt.datetime(2023, 10, 19)})

   index       Date Col_1  Col_2  Col_3
0      2 2023-10-20     Z   5.73   True

In [51]:
# Sqlite fallback
import sqlite3
con = sqlite3.connect(":memory:")
data.to_sql("data", con)
pd.read_sql_query("SELECT * FROM data", con)

   index  id                 Date Col_1  Col_2  Col_3
0      0  26  2023-10-18 00:00:00     X  27.50      1
1      1  41  2023-10-19 00:00:00     Y -12.50      0
2      2  63  2023-10-20 00:00:00     Z   5.73      1

In [ ]:
# Google BigQuery : <https://pandas-gbq.readthedocs.io/en/latest/>